names = [
    "Александр", "Алексей", "Анатолий", "Андрей", "Антон", "Аркадий", "Арсений", "Артём", "Борис", "Вадим",
    "Валентин", "Валерий", "Василий", "Виктор", "Виталий", "Владимир", "Владислав", "Вячеслав", "Геннадий",
    "Георгий",
    "Григорий", "Даниил", "Денис", "Дмитрий", "Евгений", "Егор", "Иван", "Игорь", "Илья", "Кирилл",
    "Константин", "Лев", "Леонид", "Максим", "Марат", "Матвей", "Михаил", "Никита", "Николай", "Олег",
    "Павел", "Пётр", "Роман", "Руслан", "Семён", "Сергей", "Станислав", "Степан", "Тарас", "Тимофей",
    "Фёдор", "Филипп", "Эдуард", "Юрий", "Яков", "Артур", "Давид", "Захар", "Мирон", "Савелий"
]
surnames = [
    "Иванов", "Петров", "Сидоров", "Кузнецов", "Попов", "Васильев", "Соколов", "Михайлов", "Новиков", "Федоров",
    "Морозов", "Волков", "Алексеев", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлов", "Степанов", "Николаев",
    "Орлов", "Андреев", "Макаров", "Никитин", "Захаров", "Зайцев", "Соловьев", "Борисов", "Яковлев",
    "Григорьев",
    "Романов", "Воробьев", "Сергеев", "Кузьмин", "Фролов", "Александров", "Дмитриев", "Королев", "Гусев",
    "Киселев",
    "Ильин", "Максимов", "Поляков", "Сорокин", "Виноградов", "Ковалев", "Белов", "Медведев", "Антонов",
    "Тарасов",
    "Жуков", "Баранов", "Филиппов", "Комаров", "Давыдов", "Беляев", "Герасимов", "Богданов", "Осипов", "Сидоров"
]
patronymics = [
    "Александрович", "Алексеевич", "Анатольевич", "Андреевич", "Антонович", "Аркадьевич", "Арсеньевич",
    "Артёмович", "Борисович", "Вадимович",
    "Валентинович", "Валерьевич", "Васильевич", "Викторович", "Витальевич", "Владимирович", "Владиславович",
    "Вячеславович", "Геннадьевич", "Георгиевич",
    "Григорьевич", "Данилович", "Денисович", "Дмитриевич", "Евгеньевич", "Егорович", "Иванович", "Игоревич",
    "Ильич", "Кириллович",
    "Константинович", "Львович", "Леонидович", "Максимович", "Маратович", "Матвеевич", "Михайлович", "Никитич",
    "Николаевич", "Олегович",
    "Павлович", "Петрович", "Романович", "Русланович", "Семёнович", "Сергеевич", "Станиславович", "Степанович",
    "Тарасович", "Тимофеевич",
    "Фёдорович", "Филиппович", "Эдуардович", "Юрьевич", "Яковлевич", "Артурович", "Давидович", "Захарович",
    "Миронович", "Савельевич"
]
groups = {
    1:["431101", "431102", "431103", "431104", "431105"],
    2:["432201", "432202", "432203", "432204", "432205"],
    3:["433301", "433302", "433303", "433304", "433305"],
    4:["434401", "434402", "434403", "434404", "434405"],
    5:["435501", "435502", "435503", "435504", "435505"]
}
courses = [1, 2, 3, 4, 5]

programming_languages=["Python","Java","C++","JavaScript"]
